---
kind: property
id: P:Autodesk.Revit.DB.DimensionSegment.Suffix
source: html/52cf1f26-9662-ef27-6042-b598f62d951a.htm
---
# Autodesk.Revit.DB.DimensionSegment.Suffix Property

The text shown after the segment's value.

## Syntax (C#)
```csharp
public string Suffix { get; set; }
```